theatrus/ksdk/platform/devices/MKV46F15/include/MKV46F15_features.h
    /* @brief XBARB input 24 ID. */
    #define FSL_FEATURE_XBARB_INPUT24_ID (PIT_trigger_0)
    /* @brief XBARB input 25 ID. */
    #define FSL_FEATURE_XBARB_INPUT25_ID (PIT_trigger_1)
    /* @brief XBARB input 26 ID. */
    #define FSL_FEATURE_XBARB_INPUT26_ID (PDB1_CH0_Output)
    /* @brief XBARB input 27 ID. */
    #define FSL_FEATURE_XBARB_INPUT27_ID (ADCB_ES)
    /* @brief XBARB input 28 ID. */
    #define FSL_FEATURE_XBARB_INPUT28_ID (XBARB_IN_RESERVED28)
    /* @brief XBARB input 29 ID. */
    #define FSL_FEATURE_XBARB_INPUT29_ID (XBARB_IN_RESERVED29)
    /* @brief XBARB input 30 ID. */
    #define FSL_FEATURE_XBARB_INPUT30_ID (XBARB_IN_RESERVED30)
    /* @brief XBARB input 31 ID. */
    #define FSL_FEATURE_XBARB_INPUT31_ID (XBARB_IN_RESERVED31)
    /* @brief XBARB input 32 ID. */
    #define FSL_FEATURE_XBARB_INPUT32_ID (XBARB_IN_RESERVED32)
    /* @brief XBARB input 33 ID. */
    #define FSL_FEATURE_XBARB_INPUT33_ID (XBARB_IN_RESERVED33)
    /* @brief XBARB input 34 ID. */
    #define FSL_FEATURE_XBARB_INPUT34_ID (XBARB_IN_RESERVED34)
    /* @brief XBARB input 35 ID. */
    #define FSL_FEATURE_XBARB_INPUT35_ID (XBARB_IN_RESERVED35)
    /* @brief XBARB input 36 ID. */
    #define FSL_FEATURE_XBARB_INPUT36_ID (XBARB_IN_RESERVED36)
    /* @brief XBARB input 37 ID. */
    #define FSL_FEATURE_XBARB_INPUT37_ID (XBARB_IN_RESERVED37)
    /* @brief XBARB input 38 ID. */
    #define FSL_FEATURE_XBARB_INPUT38_ID (XBARB_IN_RESERVED38)
    /* @brief XBARB input 39 ID. */
    #define FSL_FEATURE_XBARB_INPUT39_ID (XBARB_IN_RESERVED39)
    /* @brief XBARB input 40 ID. */
    #define FSL_FEATURE_XBARB_INPUT40_ID (XBARB_IN_RESERVED40)
    /* @brief XBARB input 41 ID. */
    #define FSL_FEATURE_XBARB_INPUT41_ID (XBARB_IN_RESERVED41)
    /* @brief XBARB input 42 ID. */
    #define FSL_FEATURE_XBARB_INPUT42_ID (XBARB_IN_RESERVED42)
    /* @brief XBARB input 43 ID. */
    #define FSL_FEATURE_XBARB_INPUT43_ID (XBARB_IN_RESERVED43)
    /* @brief XBARB input 44 ID. */
    #define FSL_FEATURE_XBARB_INPUT44_ID (XBARB_IN_RESERVED44)
    /* @brief XBARB input 45 ID. */
    #define FSL_FEATURE_XBARB_INPUT45_ID (XBARB_IN_RESERVED45)
    /* @brief XBARB input 46 ID. */
    #define FSL_FEATURE_XBARB_INPUT46_ID (XBARB_IN_RESERVED46)
    /* @brief XBARB input 47 ID. */
    #define FSL_FEATURE_XBARB_INPUT47_ID (XBARB_IN_RESERVED47)
    /* @brief XBARB input 48 ID. */
    #define FSL_FEATURE_XBARB_INPUT48_ID (XBARB_IN_RESERVED48)
    /* @brief XBARB input 49 ID. */
    #define FSL_FEATURE_XBARB_INPUT49_ID (XBARB_IN_RESERVED49)
    /* @brief XBARB input 50 ID. */
    #define FSL_FEATURE_XBARB_INPUT50_ID (XBARB_IN_RESERVED50)
    /* @brief XBARB input 51 ID. */
    #define FSL_FEATURE_XBARB_INPUT51_ID (XBARB_IN_RESERVED51)
    /* @brief XBARB input 52 ID. */
    #define FSL_FEATURE_XBARB_INPUT52_ID (XBARB_IN_RESERVED52)
    /* @brief XBARB input 53 ID. */
    #define FSL_FEATURE_XBARB_INPUT53_ID (XBARB_IN_RESERVED53)
    /* @brief XBARB input 54 ID. */
    #define FSL_FEATURE_XBARB_INPUT54_ID (XBARB_IN_RESERVED54)
    /* @brief XBARB input 55 ID. */
    #define FSL_FEATURE_XBARB_INPUT55_ID (XBARB_IN_RESERVED55)
    /* @brief XBARB input 56 ID. */
    #define FSL_FEATURE_XBARB_INPUT56_ID (XBARB_IN_RESERVED56)
    /* @brief XBARB input 57 ID. */
    #define FSL_FEATURE_XBARB_INPUT57_ID (XBARB_IN_RESERVED57)
    /* @brief XBARB input 58 ID. */
    #define FSL_FEATURE_XBARB_INPUT58_ID (XBARB_IN_RESERVED58)
    /* @brief XBARB input 59 ID. */
    #define FSL_FEATURE_XBARB_INPUT59_ID (XBARB_IN_RESERVED59)
    /* @brief XBARB input 60 ID. */
    #define FSL_FEATURE_XBARB_INPUT60_ID (XBARB_IN_RESERVED60)
    /* @brief XBARB input 61 ID. */
    #define FSL_FEATURE_XBARB_INPUT61_ID (XBARB_IN_RESERVED61)
    /* @brief XBARB input 62 ID. */
    #define FSL_FEATURE_XBARB_INPUT62_ID (XBARB_IN_RESERVED62)
    /* @brief XBARB input 63 ID. */
    #define FSL_FEATURE_XBARB_INPUT63_ID (XBARB_IN_RESERVED63)
    /* @brief XBARB input 64 ID. */
    #define FSL_FEATURE_XBARB_INPUT64_ID (XBARB_IN_RESERVED64)
    /* @brief XBARB input 65 ID. */
    #define FSL_FEATURE_XBARB_INPUT65_ID (XBARB_IN_RESERVED65)
    /* @brief XBARB input 66 ID. */
    #define FSL_FEATURE_XBARB_INPUT66_ID (XBARB_IN_RESERVED66)
    /* @brief XBARB input 67 ID. */
    #define FSL_FEATURE_XBARB_INPUT67_ID (XBARB_IN_RESERVED67)
    /* @brief XBARB input 68 ID. */
    #define FSL_FEATURE_XBARB_INPUT68_ID (XBARB_IN_RESERVED68)
    /* @brief XBARB input 69 ID. */
    #define FSL_FEATURE_XBARB_INPUT69_ID (XBARB_IN_RESERVED69)
    /* @brief XBARB input 70 ID. */
    #define FSL_FEATURE_XBARB_INPUT70_ID (XBARB_IN_RESERVED70)
    /* @brief XBARB input 71 ID. */
    #define FSL_FEATURE_XBARB_INPUT71_ID (XBARB_IN_RESERVED71)
    /* @brief XBARB input 72 ID. */
    #define FSL_FEATURE_XBARB_INPUT72_ID (XBARB_IN_RESERVED72)
    /* @brief XBARB input 73 ID. */
    #define FSL_FEATURE_XBARB_INPUT73_ID (XBARB_IN_RESERVED73)
    /* @brief XBARB input 74 ID. */
    #define FSL_FEATURE_XBARB_INPUT74_ID (XBARB_IN_RESERVED74)
    /* @brief XBARB input 75 ID. */
    #define FSL_FEATURE_XBARB_INPUT75_ID (XBARB_IN_RESERVED75)
    /* @brief XBARB input 76 ID. */
    #define FSL_FEATURE_XBARB_INPUT76_ID (XBARB_IN_RESERVED76)
    /* @brief XBARB input 77 ID. */
    #define FSL_FEATURE_XBARB_INPUT77_ID (XBARB_IN_RESERVED77)
    /* @brief XBARB input 78 ID. */
    #define FSL_FEATURE_XBARB_INPUT78_ID (XBARB_IN_RESERVED78)
    /* @brief XBARB input 79 ID. */
    #define FSL_FEATURE_XBARB_INPUT79_ID (XBARB_IN_RESERVED79)
    /* @brief XBARB input 80 ID. */
    #define FSL_FEATURE_XBARB_INPUT80_ID (XBARB_IN_RESERVED80)
    /* @brief XBARB input 81 ID. */
    #define FSL_FEATURE_XBARB_INPUT81_ID (XBARB_IN_RESERVED81)
    /* @brief XBARB input 82 ID. */
    #define FSL_FEATURE_XBARB_INPUT82_ID (XBARB_IN_RESERVED82)
    /* @brief XBARB input 83 ID. */
    #define FSL_FEATURE_XBARB_INPUT83_ID (XBARB_IN_RESERVED83)
    /* @brief XBARB input 84 ID. */
    #define FSL_FEATURE_XBARB_INPUT84_ID (XBARB_IN_RESERVED84)
    /* @brief XBARB input 85 ID. */
    #define FSL_FEATURE_XBARB_INPUT85_ID (XBARB_IN_RESERVED85)
    /* @brief XBARB input 86 ID. */
    #define FSL_FEATURE_XBARB_INPUT86_ID (XBARB_IN_RESERVED86)
    /* @brief XBARB input 87 ID. */
    #define FSL_FEATURE_XBARB_INPUT87_ID (XBARB_IN_RESERVED87)
    /* @brief XBARB input 88 ID. */
    #define FSL_FEATURE_XBARB_INPUT88_ID (XBARB_IN_RESERVED88)
    /* @brief XBARB input 89 ID. */
    #define FSL_FEATURE_XBARB_INPUT89_ID (XBARB_IN_RESERVED89)
    /* @brief XBARB input 90 ID. */
    #define FSL_FEATURE_XBARB_INPUT90_ID (XBARB_IN_RESERVED90)
    /* @brief XBARB input 91 ID. */
    #define FSL_FEATURE_XBARB_INPUT91_ID (XBARB_IN_RESERVED91)
    /* @brief XBARB input 92 ID. */
    #define FSL_FEATURE_XBARB_INPUT92_ID (XBARB_IN_RESERVED92)
    /* @brief XBARB input 93 ID. */
    #define FSL_FEATURE_XBARB_INPUT93_ID (XBARB_IN_RESERVED93)
    /* @brief XBARB input 94 ID. */
    #define FSL_FEATURE_XBARB_INPUT94_ID (XBARB_IN_RESERVED94)
    /* @brief XBARB input 95 ID. */
    #define FSL_FEATURE_XBARB_INPUT95_ID (XBARB_IN_RESERVED95)
    /* @brief XBARB input 96 ID. */
    #define FSL_FEATURE_XBARB_INPUT96_ID (XBARB_IN_RESERVED96)
    /* @brief XBARB input 97 ID. */
    #define FSL_FEATURE_XBARB_INPUT97_ID (XBARB_IN_RESERVED97)
    /* @brief XBARB input 98 ID. */
    #define FSL_FEATURE_XBARB_INPUT98_ID (XBARB_IN_RESERVED98)
    /* @brief XBARB input 99 ID. */
    #define FSL_FEATURE_XBARB_INPUT99_ID (XBARB_IN_RESERVED99)
    /* @brief XBARB input 100 ID. */
    #define FSL_FEATURE_XBARB_INPUT100_ID (XBARB_IN_RESERVED100)
    /* @brief XBARB input 101 ID. */
    #define FSL_FEATURE_XBARB_INPUT101_ID (XBARB_IN_RESERVED101)
    /* @brief XBARB input 102 ID. */
    #define FSL_FEATURE_XBARB_INPUT102_ID (XBARB_IN_RESERVED102)
    /* @brief XBARB input 103 ID. */
    #define FSL_FEATURE_XBARB_INPUT103_ID (XBARB_IN_RESERVED103)
    /* @brief XBARB input 104 ID. */
    #define FSL_FEATURE_XBARB_INPUT104_ID (XBARB_IN_RESERVED104)
    /* @brief XBARB input 105 ID. */
    #define FSL_FEATURE_XBARB_INPUT105_ID (XBARB_IN_RESERVED105)
    /* @brief XBARB input 106 ID. */
    #define FSL_FEATURE_XBARB_INPUT106_ID (XBARB_IN_RESERVED106)
    /* @brief XBARB input 107 ID. */
    #define FSL_FEATURE_XBARB_INPUT107_ID (XBARB_IN_RESERVED107)
    /* @brief XBARB input 108 ID. */
    #define FSL_FEATURE_XBARB_INPUT108_ID (XBARB_IN_RESERVED108)
    /* @brief XBARB input 109 ID. */
    #define FSL_FEATURE_XBARB_INPUT109_ID (XBARB_IN_RESERVED109)
    /* @brief XBARB input 110 ID. */
    #define FSL_FEATURE_XBARB_INPUT110_ID (XBARB_IN_RESERVED110)
    /* @brief XBARB input 111 ID. */
    #define FSL_FEATURE_XBARB_INPUT111_ID (XBARB_IN_RESERVED111)
    /* @brief XBARB input 112 ID. */
    #define FSL_FEATURE_XBARB_INPUT112_ID (XBARB_IN_RESERVED112)
    /* @brief XBARB input 113 ID. */
    #define FSL_FEATURE_XBARB_INPUT113_ID (XBARB_IN_RESERVED113)
    /* @brief XBARB input 114 ID. */
    #define FSL_FEATURE_XBARB_INPUT114_ID (XBARB_IN_RESERVED114)
    /* @brief XBARB input 115 ID. */
    #define FSL_FEATURE_XBARB_INPUT115_ID (XBARB_IN_RESERVED115)
    /* @brief XBARB input 116 ID. */
    #define FSL_FEATURE_XBARB_INPUT116_ID (XBARB_IN_RESERVED116)
    /* @brief XBARB input 117 ID. */
    #define FSL_FEATURE_XBARB_INPUT117_ID (XBARB_IN_RESERVED117)
    /* @brief XBARB input 118 ID. */
    #define FSL_FEATURE_XBARB_INPUT118_ID (XBARB_IN_RESERVED118)
    /* @brief XBARB input 119 ID. */
    #define FSL_FEATURE_XBARB_INPUT119_ID (XBARB_IN_RESERVED119)
    /* @brief XBARB input 120 ID. */
    #define FSL_FEATURE_XBARB_INPUT120_ID (XBARB_IN_RESERVED120)
    /* @brief XBARB input 121 ID. */
    #define FSL_FEATURE_XBARB_INPUT121_ID (XBARB_IN_RESERVED121)
    /* @brief XBARB input 122 ID. */
    #define FSL_FEATURE_XBARB_INPUT122_ID (XBARB_IN_RESERVED122)
    /* @brief XBARB input 123 ID. */
    #define FSL_FEATURE_XBARB_INPUT123_ID (XBARB_IN_RESERVED123)
    /* @brief XBARB input 124 ID. */
    #define FSL_FEATURE_XBARB_INPUT124_ID (XBARB_IN_RESERVED124)
    /* @brief XBARB input 125 ID. */
    #define FSL_FEATURE_XBARB_INPUT125_ID (XBARB_IN_RESERVED125)
    /* @brief XBARB input 126 ID. */
    #define FSL_FEATURE_XBARB_INPUT126_ID (XBARB_IN_RESERVED126)
    /* @brief XBARB input 127 ID. */
    #define FSL_FEATURE_XBARB_INPUT127_ID (XBARB_IN_RESERVED127)
    /* @brief XBARB output 0 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT0_ID (AOI_IN0)
    /* @brief XBARB output 1 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT1_ID (AOI_IN1)
    /* @brief XBARB output 2 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT2_ID (AOI_IN2)
    /* @brief XBARB output 3 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT3_ID (AOI_IN3)
    /* @brief XBARB output 4 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT4_ID (AOI_IN4)
    /* @brief XBARB output 5 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT5_ID (AOI_IN5)
    /* @brief XBARB output 6 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT6_ID (AOI_IN6)
    /* @brief XBARB output 7 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT7_ID (AOI_IN7)
    /* @brief XBARB output 8 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT8_ID (AOI_IN8)
    /* @brief XBARB output 9 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT9_ID (AOI_IN9)
    /* @brief XBARB output 10 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT10_ID (AOI_IN10)
    /* @brief XBARB output 11 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT11_ID (AOI_IN11)
    /* @brief XBARB output 12 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT12_ID (AOI_IN12)
    /* @brief XBARB output 13 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT13_ID (AOI_IN13)
    /* @brief XBARB output 14 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT14_ID (AOI_IN14)
    /* @brief XBARB output 15 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT15_ID (AOI_IN15)
    /* @brief XBARB output 16 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT16_ID (XBARB_OUT_RESERVED16)
    /* @brief XBARB output 17 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT17_ID (XBARB_OUT_RESERVED17)
    /* @brief XBARB output 18 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT18_ID (XBARB_OUT_RESERVED18)
    /* @brief XBARB output 19 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT19_ID (XBARB_OUT_RESERVED19)
    /* @brief XBARB output 20 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT20_ID (XBARB_OUT_RESERVED20)
    /* @brief XBARB output 21 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT21_ID (XBARB_OUT_RESERVED21)
    /* @brief XBARB output 22 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT22_ID (XBARB_OUT_RESERVED22)
    /* @brief XBARB output 23 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT23_ID (XBARB_OUT_RESERVED23)
    /* @brief XBARB output 24 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT24_ID (XBARB_OUT_RESERVED24)
    /* @brief XBARB output 25 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT25_ID (XBARB_OUT_RESERVED25)
    /* @brief XBARB output 26 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT26_ID (XBARB_OUT_RESERVED26)
    /* @brief XBARB output 27 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT27_ID (XBARB_OUT_RESERVED27)
    /* @brief XBARB output 28 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT28_ID (XBARB_OUT_RESERVED28)
    /* @brief XBARB output 29 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT29_ID (XBARB_OUT_RESERVED29)
    /* @brief XBARB output 30 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT30_ID (XBARB_OUT_RESERVED30)
    /* @brief XBARB output 31 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT31_ID (XBARB_OUT_RESERVED31)
    /* @brief XBARB output 32 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT32_ID (XBARB_OUT_RESERVED32)
    /* @brief XBARB output 33 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT33_ID (XBARB_OUT_RESERVED33)
    /* @brief XBARB output 34 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT34_ID (XBARB_OUT_RESERVED34)
    /* @brief XBARB output 35 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT35_ID (XBARB_OUT_RESERVED35)
    /* @brief XBARB output 36 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT36_ID (XBARB_OUT_RESERVED36)
    /* @brief XBARB output 37 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT37_ID (XBARB_OUT_RESERVED37)
    /* @brief XBARB output 38 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT38_ID (XBARB_OUT_RESERVED38)
    /* @brief XBARB output 39 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT39_ID (XBARB_OUT_RESERVED39)
    /* @brief XBARB output 40 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT40_ID (XBARB_OUT_RESERVED40)
    /* @brief XBARB output 41 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT41_ID (XBARB_OUT_RESERVED41)
    /* @brief XBARB output 42 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT42_ID (XBARB_OUT_RESERVED42)
    /* @brief XBARB output 43 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT43_ID (XBARB_OUT_RESERVED43)
    /* @brief XBARB output 44 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT44_ID (XBARB_OUT_RESERVED44)
    /* @brief XBARB output 45 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT45_ID (XBARB_OUT_RESERVED45)
    /* @brief XBARB output 46 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT46_ID (XBARB_OUT_RESERVED46)
    /* @brief XBARB output 47 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT47_ID (XBARB_OUT_RESERVED47)
    /* @brief XBARB output 48 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT48_ID (XBARB_OUT_RESERVED48)
    /* @brief XBARB output 49 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT49_ID (XBARB_OUT_RESERVED49)
    /* @brief XBARB output 50 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT50_ID (XBARB_OUT_RESERVED50)
    /* @brief XBARB output 51 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT51_ID (XBARB_OUT_RESERVED51)
    /* @brief XBARB output 52 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT52_ID (XBARB_OUT_RESERVED52)
    /* @brief XBARB output 53 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT53_ID (XBARB_OUT_RESERVED53)
    /* @brief XBARB output 54 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT54_ID (XBARB_OUT_RESERVED54)
    /* @brief XBARB output 55 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT55_ID (XBARB_OUT_RESERVED55)
    /* @brief XBARB output 56 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT56_ID (XBARB_OUT_RESERVED56)
    /* @brief XBARB output 57 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT57_ID (XBARB_OUT_RESERVED57)
    /* @brief XBARB output 58 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT58_ID (XBARB_OUT_RESERVED58)
    /* @brief XBARB output 59 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT59_ID (XBARB_OUT_RESERVED59)
    /* @brief XBARB output 60 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT60_ID (XBARB_OUT_RESERVED60)
    /* @brief XBARB output 61 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT61_ID (XBARB_OUT_RESERVED61)
    /* @brief XBARB output 62 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT62_ID (XBARB_OUT_RESERVED62)
    /* @brief XBARB output 63 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT63_ID (XBARB_OUT_RESERVED63)
    /* @brief XBARB output 64 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT64_ID (XBARB_OUT_RESERVED64)
    /* @brief XBARB output 65 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT65_ID (XBARB_OUT_RESERVED65)
    /* @brief XBARB output 66 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT66_ID (XBARB_OUT_RESERVED66)
    /* @brief XBARB output 67 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT67_ID (XBARB_OUT_RESERVED67)
    /* @brief XBARB output 68 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT68_ID (XBARB_OUT_RESERVED68)
    /* @brief XBARB output 69 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT69_ID (XBARB_OUT_RESERVED69)
    /* @brief XBARB output 70 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT70_ID (XBARB_OUT_RESERVED70)
    /* @brief XBARB output 71 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT71_ID (XBARB_OUT_RESERVED71)
    /* @brief XBARB output 72 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT72_ID (XBARB_OUT_RESERVED72)
    /* @brief XBARB output 73 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT73_ID (XBARB_OUT_RESERVED73)
    /* @brief XBARB output 74 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT74_ID (XBARB_OUT_RESERVED74)
    /* @brief XBARB output 75 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT75_ID (XBARB_OUT_RESERVED75)
    /* @brief XBARB output 76 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT76_ID (XBARB_OUT_RESERVED76)
    /* @brief XBARB output 77 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT77_ID (XBARB_OUT_RESERVED77)
    /* @brief XBARB output 78 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT78_ID (XBARB_OUT_RESERVED78)
    /* @brief XBARB output 79 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT79_ID (XBARB_OUT_RESERVED79)
    /* @brief XBARB output 80 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT80_ID (XBARB_OUT_RESERVED80)
    /* @brief XBARB output 81 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT81_ID (XBARB_OUT_RESERVED81)
    /* @brief XBARB output 82 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT82_ID (XBARB_OUT_RESERVED82)
    /* @brief XBARB output 83 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT83_ID (XBARB_OUT_RESERVED83)
    /* @brief XBARB output 84 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT84_ID (XBARB_OUT_RESERVED84)
    /* @brief XBARB output 85 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT85_ID (XBARB_OUT_RESERVED85)
    /* @brief XBARB output 86 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT86_ID (XBARB_OUT_RESERVED86)
    /* @brief XBARB output 87 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT87_ID (XBARB_OUT_RESERVED87)
    /* @brief XBARB output 88 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT88_ID (XBARB_OUT_RESERVED88)
    /* @brief XBARB output 89 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT89_ID (XBARB_OUT_RESERVED89)
    /* @brief XBARB output 90 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT90_ID (XBARB_OUT_RESERVED90)
    /* @brief XBARB output 91 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT91_ID (XBARB_OUT_RESERVED91)
    /* @brief XBARB output 92 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT92_ID (XBARB_OUT_RESERVED92)
    /* @brief XBARB output 93 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT93_ID (XBARB_OUT_RESERVED93)
    /* @brief XBARB output 94 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT94_ID (XBARB_OUT_RESERVED94)
    /* @brief XBARB output 95 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT95_ID (XBARB_OUT_RESERVED95)
    /* @brief XBARB output 96 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT96_ID (XBARB_OUT_RESERVED96)
    /* @brief XBARB output 97 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT97_ID (XBARB_OUT_RESERVED97)
    /* @brief XBARB output 98 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT98_ID (XBARB_OUT_RESERVED98)
    /* @brief XBARB output 99 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT99_ID (XBARB_OUT_RESERVED99)
    /* @brief XBARB output 100 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT100_ID (XBARB_OUT_RESERVED100)
    /* @brief XBARB output 101 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT101_ID (XBARB_OUT_RESERVED101)
    /* @brief XBARB output 102 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT102_ID (XBARB_OUT_RESERVED102)
    /* @brief XBARB output 103 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT103_ID (XBARB_OUT_RESERVED103)
    /* @brief XBARB output 104 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT104_ID (XBARB_OUT_RESERVED104)
    /* @brief XBARB output 105 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT105_ID (XBARB_OUT_RESERVED105)
    /* @brief XBARB output 106 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT106_ID (XBARB_OUT_RESERVED106)
    /* @brief XBARB output 107 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT107_ID (XBARB_OUT_RESERVED107)
    /* @brief XBARB output 108 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT108_ID (XBARB_OUT_RESERVED108)
    /* @brief XBARB output 109 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT109_ID (XBARB_OUT_RESERVED109)
    /* @brief XBARB output 110 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT110_ID (XBARB_OUT_RESERVED110)
    /* @brief XBARB output 111 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT111_ID (XBARB_OUT_RESERVED111)
    /* @brief XBARB output 112 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT112_ID (XBARB_OUT_RESERVED112)
    /* @brief XBARB output 113 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT113_ID (XBARB_OUT_RESERVED113)
    /* @brief XBARB output 114 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT114_ID (XBARB_OUT_RESERVED114)
    /* @brief XBARB output 115 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT115_ID (XBARB_OUT_RESERVED115)
    /* @brief XBARB output 116 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT116_ID (XBARB_OUT_RESERVED116)
    /* @brief XBARB output 117 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT117_ID (XBARB_OUT_RESERVED117)
    /* @brief XBARB output 118 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT118_ID (XBARB_OUT_RESERVED118)
    /* @brief XBARB output 119 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT119_ID (XBARB_OUT_RESERVED119)
    /* @brief XBARB output 120 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT120_ID (XBARB_OUT_RESERVED120)
    /* @brief XBARB output 121 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT121_ID (XBARB_OUT_RESERVED121)
    /* @brief XBARB output 122 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT122_ID (XBARB_OUT_RESERVED122)
    /* @brief XBARB output 123 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT123_ID (XBARB_OUT_RESERVED123)
    /* @brief XBARB output 124 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT124_ID (XBARB_OUT_RESERVED124)
    /* @brief XBARB output 125 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT125_ID (XBARB_OUT_RESERVED125)
    /* @brief XBARB output 126 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT126_ID (XBARB_OUT_RESERVED126)
    /* @brief XBARB output 127 ID. */
    #define FSL_FEATURE_XBARB_OUTPUT127_ID (XBARB_OUT_RESERVED127)
#endif

#endif /* __FSL_MKV46F15_FEATURES_H__ */

/*******************************************************************************
 * EOF
 ******************************************************************************/
